### python 라이브러리(패키지)
- 크롤링 : requests + BeautifulSoup / Seleniu,
- 데이터분석 : pandas
- 숫자(배열, 행렬) 계산 : numpy
- 머신러닝 / 딥러닝 : scikit-learn,Pytorchm TensorFlow

In [ ]:
# !pip install pandas

Collecting pandas
  Downloading pandas-3.0.1-cp314-cp314-win_amd64.whl.metadata (19 kB)
Collecting numpy>=2.3.3 (from pandas)
  Downloading numpy-2.4.2-cp314-cp314-win_amd64.whl.metadata (6.6 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\source\pythonsource\.venv\Lib\site-packages (from pandas) (2.9.0.post0)
Collecting tzdata (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\source\pythonsource\.venv\Lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-3.0.1-cp314-cp314-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   -- ------------------------------------- 0.5/9.9 MB 3.0 MB/s eta 0:00:04
   --- ------------------------------------ 0.8/9.9 MB 2.1 MB/s eta 0:00:05
   ---- ----------------------------------- 1.0/9.9 MB 1.6 MB/s eta 0:00:06
   ---- ----------------------------------- 1.0/9.9 MB 1.6 MB/s eta 0:00:06
   ----- ---------------------------------- 1.3/9.9 MB 1.2 MB/s eta 0:00:08
   -------- ------------------------------- 2.1/9.9 MB 1.6 MB/s eta 0:00:05
   -------------- ------------------------- 3.7/9.9 MB 2.5 MB/s eta 0:00:03
   --------------- ------------------------ 3.9/9.9 MB 2.4 MB/s eta 0:00:03
   ------------------- -------------------- 4.7/9.9 MB 2.5 MB/s eta 0:00:03
   ------------------------ --------------- 6.0/9.9 MB 2.9 MB/s eta 0:00:02
   --------------------------- ------------ 6.8/9.9 MB 3.1 MB/s eta 0:00:01
   ----------------------------- ---------- 7.3/9.9 MB 3.0 MB/s eta 0:00:01
   ------------------------------ --------- 7.6/9.9 MB 2.9 MB/s eta 0:00:01
   ------------------------------- -------- 7.9/9.9 MB 2.7 MB/s eta 0:00:01
   ------------------------------- -------- 7.9/9.9 MB 2.7 MB/s eta 0:00:01
   ---------------------------------------- 9.9/9.9 MB 3.0 MB/s  0:00:03
Downloading numpy-2.4.2-cp314-cp314-win_amd64.whl (12.4 MB)
   ---------------------------------------- 0.0/12.4 MB ? eta -:--:--
   ------- -------------------------------- 2.4/12.4 MB 11.3 MB/s eta 0:00:01
   ---------- ----------------------------- 3.4/12.4 MB 8.6 MB/s eta 0:00:02
   ------------ --------------------------- 3.9/12.4 MB 6.0 MB/s eta 0:00:02
   -------------- ------------------------- 4.5/12.4 MB 5.3 MB/s eta 0:00:02
   --------------------- ------------------ 6.6/12.4 MB 6.1 MB/s eta 0:00:01
   ----------------------- ---------------- 7.3/12.4 MB 5.7 MB/s eta 0:00:01
   ------------------------- -------------- 7.9/12.4 MB 5.4 MB/s eta 0:00:01
   --------------------------- ------------ 8.7/12.4 MB 5.1 MB/s eta 0:00:01
   ------------------------------ --------- 9.4/12.4 MB 5.0 MB/s eta 0:00:01
   --------------------------------- ------ 10.5/12.4 MB 5.1 MB/s eta 0:00:01
   ----------------------------------- ---- 11.0/12.4 MB 4.8 MB/s eta 0:00:01
   ------------------------------------- -- 11.5/12.4 MB 4.6 MB/s eta 0:00:01
   -------------------------------------- - 12.1/12.4 MB 4.5 MB/s eta 0:00:01
   ---------------------------------------- 12.4/12.4 MB 4.3 MB/s  0:00:02
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: tzdata, numpy, pandas

   ---------------------------------------- 0/3 [tzdata]
   ---------------------------------------- 0/3 [tzdata]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   ------------- -------------------------- 1/3 [numpy]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   ---------------------------------------- 3/3 [pandas]

Successfully installed numpy-2.4.2 pandas-3.0.1 tzdata-2025.3

[notice] A new release of pip is available: 26.0 -> 26.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

#### Pandas
- 테이블 형태의 데이터를 다루는데 사용하는 데이터 분석 패키지
- 구조 : Series, DataFrame

In [3]:
import pandas as pd

In [4]:
series = pd.Series([70,60,90])
series

0    70
1    60
2    90
dtype: int64

In [6]:
series = pd.Series({"a":1,"b":2,"c":3})
series

a    1
b    2
c    3
dtype: int64

In [8]:
series = pd.Series([70,60,90],index=["국어","영어","수학"])
series

국어    70
영어    60
수학    90
dtype: int64

In [ ]:
# 조회
print(series.국어)
print(series.index)
print(series.values)
print(series.shape) # 튜플로 몇 행인지
print(series.head(1)) # 앞에서부터  하나
print(series.tail(1)) # 뒤에서부터  하나

70
Index(['국어', '영어', '수학'], dtype='str')
[70 60 90]
(3,)
국어    70
dtype: int64
수학    90
dtype: int64

In [18]:
# 수정
series.index = ["미술","음악","체육"]
series
# dtype: int64 -> int 64비트로 표현하는 중
# java : int 4 byte, long : 8 byte

# 타입변경
series = series.astype("int32")
series

미술    70
음악    60
체육    90
dtype: int32

In [21]:
# 제거
del series['음악']
series

체육    90
dtype: int32

In [24]:
# DataFrame : 가장 많이 사용됨
friend_dict_list = [
    {
        "name": "John",
        "age":25,
        "Job" : "student"
    },
    {
        "name": "Nate",
        "age":30,
        "Job" : "teacher"
    },
    {
        "name": "Jenny",
        "age":30,
        "Job" : "developer"
    },
]

In [25]:
friend_df = pd.DataFrame(friend_dict_list)
friend_df

    name  age        Job
0   John   25    student
1   Nate   30    teacher
2  Jenny   30  developer

In [26]:
dict = {"국어":[15,25,35],"영어":[45,55,65],"수학":[36,46,56]}
student_df = pd.DataFrame(dict)
student_df

   국어  영어  수학
0  15  45  36
1  25  55  46
2  35  65  56

In [27]:
person_df = pd.DataFrame(friend_dict_list, index =["f1","f2","f3"])
person_df

     name  age        Job
f1   John   25    student
f2   Nate   30    teacher
f3  Jenny   30  developer

In [31]:
list1 = [
    [1,2,3,4,5],
    [6,7,8,9,10]
]
two_df = pd.DataFrame(list1, index=["내용1","내용2"],columns=["c1","c2","c3","c4","c5"])
two_df

     c1  c2  c3  c4  c5
내용1   1   2   3   4   5
내용2   6   7   8   9  10

In [39]:
# ms -> cp949
sample_df1 = pd.read_csv("./data/sample1.csv", encoding="cp949", index_col=0, header=None)
sample_df1

      1                    2   3
0
번호   이름                 가입일시  나이
1   김정수  2017-01-19 11:30:00  25
2   박민구  2017-02-07 10:22:00  35
3   정순미  2017-01-22 09:10:00  33
4   김정현  2017-02-22 14:09:00  45
5   홍미진  2017-04-01 18:00:00  17
6   김순철  2017-05-14 22:33:07  22
7   이동철  2017-03-01 23:44:45  27
8   박지숙  2017-01-11 06:04:18  30
9   김은미  2017-02-08 07:44:33  51
10  장혁철  2017-12-01 13:01:11  16

In [37]:
sample_df2 = pd.read_csv("./data/sample3.csv", encoding="cp949",delimiter="|", header=None)
sample_df2

   0    1                    2   3
0  1  김정수  2017-01-18 11:30:00  25
1  2  박민구  2017-02-07 10:22:00  35
2  3  정순미  2017-01-22 09:10:00  33
3  4  김정현  2017-02-22 14:30:00  45
4  5  홍미진  2017-01-18 11:30:00  24
5  6  이동철  2017-03-01 23:30:00  27
6  7  김은미  2017-04-01 23:30:00  25

In [41]:
file_df = pd.read_excel("./data/file1.xlsx", header=None)
file_df

    0   1   2   3   4   5    6   7   8   9
0  29  16  49  85  42   6   42  69  29  39
1  33  10  34  45  69  12   43  11  63   1
2  56  97  62   1  85  27   71  10  33  94
3  57   0  68  30   1  96   12  60  49  42
4  27   9  59  45  42  60   78  15  36  22
5  38  58  49  48   5  83    0  72  98  24
6  64   5  71   5  95  23   46  78  82  95
7  38  52  60  78  82  85  100  99   5  54
8  52  86   3  87  14  18   45  32  13  22
9  49  49  58  25   2  87   32   1  69  84

In [ ]:
# 조회
print(friend_df.index)
print(friend_df.values)
print(friend_df.columns)
# 필드명이 한글이 아래이라면 []의 방식이 좀 더 안정적
print(friend_df.age)
print(friend_df['age'])

RangeIndex(start=0, stop=3, step=1)
[['John' 25 'student']
 ['Nate' 30 'teacher']
 ['Jenny' 30 'developer']]
Index(['name', 'age', 'Job'], dtype='str')
0    25
1    30
2    30
Name: age, dtype: int64
0    25
1    30
2    30
Name: age, dtype: int64

In [49]:
# Nate 정보만 추출 : 슬라이싱
# loc, iloc(index)
print(friend_df.loc[0])
print(friend_df.loc[0:1])

name       John
age          25
Job     student
Name: 0, dtype: object
   name  age      Job
0  John   25  student
1  Nate   30  teacher

In [ ]:
print(friend_df.iloc[0])
# iloc: 마지막 자리 포함 안함
print(friend_df.iloc[0:1])

name       John
age          25
Job     student
Name: 0, dtype: object
   name  age      Job
0  John   25  student

In [52]:
student_df.loc[2]
student_df.loc[1:2,"국어"]

1    25
2    35
Name: 국어, dtype: int64

In [ ]:
# iloc: index location / loc: 이름 기반
student_df.iloc[1:2,0]

1    25
Name: 국어, dtype: int64

In [55]:
person_df

     name  age        Job
f1   John   25    student
f2   Nate   30    teacher
f3  Jenny   30  developer

In [59]:
person_df.loc["f1":"f2","age"]

f1    25
f2    30
Name: age, dtype: int64

In [61]:
person_df.iloc[0:2,1]

f1    25
f2    30
Name: age, dtype: int64

In [63]:
# friend_df 에서 age >= 25
friend_df[friend_df.age >=30]

    name  age        Job
1   Nate   30    teacher
2  Jenny   30  developer

In [ ]:
# 25보다 크고, 이름이 Nate 인 사람 조회
# python : age > 25 and name == 'Nate'

friend_df[(friend_df.age > 25)&(friend_df.name == 'Nate')]
friend_df.query("age > 25" and "name == 'Nate'")

   name  age      Job
1  Nate   30  teacher

In [68]:
student_df[student_df["국어"] >=20]

   국어  영어  수학
1  25  55  46
2  35  65  56

In [71]:
# 총 판매 수량 > 250조회 
# ms -> cp949
exam = pd.read_excel("./data/sample.xlsx")
exam[exam["총 판매수량"]>250]

   Sap Co.       대리점 영업사원       전월       금월  TEAM  총 판매수량
2   KI1534   경기화성대리점  경인선   600000  2214000     1     320
14  KI2776  경기남양주대리점  김수진  8160000  4352000     2     354
18  KI3131   경기하남대리점  김민정  2750000  7268000     3     293

In [79]:
# 2~3행 조회
exam.iloc[2:4]
exam.loc[2:3]

  Sap Co.      대리점 영업사원       전월       금월  TEAM  총 판매수량
2  KI1534  경기화성대리점  경인선   600000  2214000     1     320
3  KI1636  강원속초대리점  이동권  3720000  2870000     3     110

In [81]:
# 금월 컬럼 조회
exam['금월'].head()

0    2952000
1    2706000
2    2214000
3    2870000
4    2296000
Name: 금월, dtype: int64

In [85]:
# 2~3행 조회, 대리점명, 총 판매수량
exam.loc[2:3,["대리점","총 판매수량"]]
exam.iloc[2:4,[1,6]]

       대리점  총 판매수량
2  경기화성대리점     320
3  강원속초대리점     110

In [88]:
# Nate -> Torres 변경
friend_df.iloc[1,0] = 'Torres'

In [89]:
friend_df

     name  age        Job
0    John   25    student
1  Torres   30    teacher
2   Jenny   30  developer

In [90]:
# 3 번행 추가
friend_df.loc[3] = ["Mike",30, "student"]
friend_df

     name  age        Job
0    John   25    student
1  Torres   30    teacher
2   Jenny   30  developer
3    Mike   30    student

In [91]:
# 컬럼추가
friend_df['addr'] = ['서울','경기','부산','대구']
friend_df

     name  age        Job addr
0    John   25    student   서울
1  Torres   30    teacher   경기
2   Jenny   30  developer   부산
3    Mike   30    student   대구

In [95]:
friend_df = friend_df.drop("addr",axis=1)
# 혹은 friend_df.drop("age",axis=1, inplace=True)

In [96]:
friend_df

     name        Job
0    John    student
1  Torres    teacher
2   Jenny  developer
3    Mike    student

In [99]:
student_df

   국어  영어  수학  과학
0  15  45  36  55
1  25  55  46  80
2  35  65  56  20

In [98]:
# 과학 컬럼 추가
student_df['과학'] = [55,80,20]

In [101]:
student_df.to_csv("./data/student.csv",index=False)